model {
  center_net {
    num_classes: 14
    feature_extractor {
      type: "hourglass_104"
      channel_means: 104.01361846923828
      channel_means: 114.03422546386719
      channel_means: 119.91659545898438
      channel_stds: 73.60276794433594
      channel_stds: 69.89082336425781
      channel_stds: 70.91507720947266
      bgr_ordering: true
    }
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 512
        max_dimension: 512
        pad_to_max_dimension: true
      }
    }
    object_detection_task {
      task_loss_weight: 1.0
      offset_loss_weight: 1.0
      scale_loss_weight: 0.10000000149011612
      localization_loss {
        l1_localization_loss {
        }
      }
    }
    object_center_params {
      object_center_loss_weight: 1.0
      classification_loss {
        penalty_reduced_logistic_focal_loss {
          alpha: 2.0
          beta: 4.0
        }
      }
      min_box_overlap_iou: 0.699999988079071
      max_box_predictions: 100
    }
  }
}
train_config {
  batch_size: 4
  optimizer {
    adam_optimizer {
      learning_rate {
        cosine_decay_learning_rate {
          learning_rate_base: 1e-3
          total_steps: 20000
          warmup_learning_rate: 2.5e-4
          warmup_steps: 1000
        }
      }
      epsilon: 1.0000000116860974e-07
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "/kaggle/input/tensorflowmodelzoo/enternet_hg104_512x512_coco17_tpu-8/checkpoint/ckpt-0"
  num_steps: 20000
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "fine_tune"
  fine_tune_checkpoint_version: V2
}

train_input_reader: {
  label_map_path: "/kaggle/working/odapi_training/labels/label_map_vinbig_1.pbtxt"
  tf_record_input_reader {
    input_path: "/kaggle/input/vinbigdata-512jpg/train.tfrecord"
  }
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  metrics_set: "pascal_voc_detection_metrics"
  use_moving_averages: false
  batch_size: 1;
}

eval_input_reader: {
  label_map_path: "/kaggle/working/odapi_training/labels/label_map_vinbig_1.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "/kaggle/input/vinbigdata-512jpg/train.tfrecord"
  }
}
